[
    {
        "name": "Joshua Homme",
        "description": "Joshua Michael Homme is an American singer, songwriter, musician, record producer, and actor. He is the founder, primary songwriter, and only continuous member of the rock band Queens of the Stone Age, which he formed in 1996 and in which he sings lead vocals and plays guitar,    as well as occasionally playing bass, piano, and drums. He also co-founded Eagles of Death Metal in 1998, playing drums and bass guitar for their studio recordings and occasionally performing live with them. Homme was formerly the co-founder and guitarist of the rock band Kyuss from 1987 to 1995. He has produced a musical improv series with other musicians (mostly from the Palm Desert Scene) known as The Desert Sessions since 1997. He formed a new project in 2009 called Them Crooked Vultures with Dave Grohl and John Paul Jones, releasing their self-titled debut album later that year. In 2016, he produced, co-wrote, and performed on the Iggy Pop album Post Pop Depression. He has also been involved with acts such as Foo Fighters and Arctic Monkeys.",
        "image_source": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5e/Josh-Homme-StPaul-12-03-2017.jpg/330px-Josh-Homme-StPaul-12-03-2017.jpg",
        "url": "joshua-homme"
    },
    {
        "name": "Troy Van Leeuwen",
        "description": "Troy Van Leeuwen (born January 5, 1970) is an American rock musician and producer. He is best known as the guitarist for the rock band Queens of the Stone Age (QOTSA), for which he has served since 2002. He is also known for his work with the rock band Failure, and with alternative rock supergroup A Perfect Circle, as well as recordings with QOTSA members' side projects such as the Desert Sessions, Mondo Generator, Eagles of Death Metal and the Gutter Twins. Van Leeuwen created his first side-project, Enemy, in 2005, Sweethead, in 2008, Gone Is Gone, in 2016, and toured with Iggy Pop supporting his album Post Pop Depression made with QOTSA bandmates Josh Homme and Dean Fertita.",
        "image_source": "https://upload.wikimedia.org/wikipedia/commons/9/95/Troy%2BVan%2BLeeuwen.jpg",
        "url": "troy-van-leeuwen"

    },
    {
        "name": "Michael Shuman",
        "description": "Michael Jay Shuman (born August 20, 1985), also known as Mikey Shoes, is an American musician and songwriter. He is best known for playing bass with rock band Queens of the Stone Age. Shuman co-founded, co-fronted, and played bass for Jubilee until late 2008, and is the bassist of Wires On Fire, both on Buddyhead Records. He joined Queens of the Stone Age in 2007 before the release of Era Vulgaris replacing Alain Johannes, who chose to focus on other musical projects. In 2013, Queens of the Stone Age released ...Like Clockwork, their first full album since Shuman joined the band. On the album, Shuman provides vocals and plays bass, percussion, guitar, twelve-string guitar, and Mellotron. The album was the first Queens of the Stone Age album to reach number one on the Billboard 200. It also reached number two on the UK Albums Chart and was nominated for three Grammy Awards, including Best Rock Album.",
        "image_source": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c7/Queen_of_the_Stone_Edge-Michael_Shuman-IMG_6648.jpg/330px-Queen_of_the_Stone_Edge-Michael_Shuman-IMG_6648.jpg",
        "url": "michael-shuman"
    },
    {
        "name": "Dean Fertita",
        "description": "Dean Anthony Fertita (born September 6, 1970) is an American rock multi-instrumentalist. He is best known as a member of the hard rock band Queens of the Stone Age, and as the guitarist and keyboardist for the Dead Weather./ Fertita was the lead singer and guitarist of the Waxwings from the band's formation in 1997 to its breakup in 2005. Fertita then moved on to collaborate with Brendan Benson, playing keyboards and guitar on Benson's solo releases and as a touring keyboard player for the Raconteurs. In 2007, Fertita joined Queens of the Stone Age to replace the late Natasha Shneider on keyboards and occasionally guitar on some songs. In 2009, Fertita released his debut album as a solo artist. In 2015, Fertita collaborated with his Queens of the Stone Age bandmate Josh Homme in recording Iggy Pop's studio album, Post Pop Depression (2016).",
        "image_source": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c4/14-06-07_RiP_Queens_of_the_Stone_Age_Troy_van_Leeuwen_1.JPG/300px-14-06-07_RiP_Queens_of_the_Stone_Age_Troy_van_Leeuwen_1.JPG",
        "url": "dean-fertita"
    },
    {
        "name": "Jon Theodore",
        "description": "Jon Philip Theodore (born December 30, 1973) is an American drummer. He is best known as a former member of The Mars Volta and as the current drummer for Queens of the Stone Age. Theodore is also a member of One Day as a Lion. Known for his explosive, multi-textural playing style, Theodore was a member of both Golden and Royal Trux before joining The Mars Volta in 2001. Theodore remained within the band for five years, recording the band's first three studio albums, De-Loused in the Comatorium (2003), Frances the Mute (2005) and Amputechture (2006), before departing at the request of guitarist and bandleader Omar Rodríguez-López. Theodore subsequently formed a collaboration with Rage Against the Machine vocalist Zack de la Rocha, entitled One Day as a Lion, and performed on Incubus frontman Brandon Boyd's solo album, The Wild Trapeze (2010). In 2012, Theodore replaced his Mars Volta successor Thomas Pridgen in the supergroup Giraffe Tongue Orchestra, though by 2015 the lineup had reverted to Pridgen on drums. In 2013, Theodore joined Queens of the Stone Age, replacing Joey Castillo, who left the band citing burnout from constant touring[citation needed]. Although Dave Grohl recorded the drums on Queens of the Stone Age's sixth studio album ...Like Clockwork (2013), Theodore accompanied them on the subsequent tour and has since become a full-time member.",
        "image_source": "https://www.moderndrummer.com/wp-content/uploads/2017/10/Jon-Theodore-3.jpg",
        "url": "jon-theodore"
    }
]